# 5. 데이터 확인

In [2]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col = '지원번호')
df

       이름   학교   국어   영어   수학   과학   사회    SW특기
지원번호
1번    강민수  세종초  100   85  100   85  100  Python
2번    배성현  포항초   95   90   95   90   95       C
3번    박세환  동탄초   90   95   90   95   90     C++
4번    정태경  덕소초   85  100   85  100   85     NaN

## DataFrame 확인
계산 가능한 데이터에 대해 column별로 데이터의 갯수, 평균, 표준편차, 최소/최대값 등의 정보를 보여줌

In [3]:
df.describe()

               국어          영어          수학          과학          사회
count    4.000000    4.000000    4.000000    4.000000    4.000000
mean    92.500000   92.500000   92.500000   92.500000   92.500000
std      6.454972    6.454972    6.454972    6.454972    6.454972
min     85.000000   85.000000   85.000000   85.000000   85.000000
25%     88.750000   88.750000   88.750000   88.750000   88.750000
50%     92.500000   92.500000   92.500000   92.500000   92.500000
75%     96.250000   96.250000   96.250000   96.250000   96.250000
max    100.000000  100.000000  100.000000  100.000000  100.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1번 to 4번
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   학교      4 non-null      object
 2   국어      4 non-null      int64
 3   영어      4 non-null      int64
 4   수학      4 non-null      int64
 5   과학      4 non-null      int64
 6   사회      4 non-null      int64
 7   SW특기    3 non-null      object
dtypes: int64(5), object(3)
memory usage: 288.0+ bytes

In [5]:
df.head() #처음 5개의 row를 가져옴

       이름   학교   국어   영어   수학   과학   사회    SW특기
지원번호
1번    강민수  세종초  100   85  100   85  100  Python
2번    배성현  포항초   95   90   95   90   95       C
3번    박세환  동탄초   90   95   90   95   90     C++
4번    정태경  덕소초   85  100   85  100   85     NaN

In [6]:
df.head(2) #처음 2개의 row를 가져옴

       이름   학교   국어  영어   수학  과학   사회    SW특기
지원번호
1번    강민수  세종초  100  85  100  85  100  Python
2번    배성현  포항초   95  90   95  90   95       C

In [7]:
df.tail() #마지막 5개 row를 가져옴

       이름   학교   국어   영어   수학   과학   사회    SW특기
지원번호
1번    강민수  세종초  100   85  100   85  100  Python
2번    배성현  포항초   95   90   95   90   95       C
3번    박세환  동탄초   90   95   90   95   90     C++
4번    정태경  덕소초   85  100   85  100   85     NaN

In [8]:
df.tail(2) #마지막 2개 row를 가져옴

       이름   학교  국어   영어  수학   과학  사회 SW특기
지원번호
3번    박세환  동탄초  90   95  90   95  90  C++
4번    정태경  덕소초  85  100  85  100  85  NaN

In [9]:
df.values

array([['강민수', '세종초', 100, 85, 100, 85, 100, 'Python'],
       ['배성현', '포항초', 95, 90, 95, 90, 95, 'C'],
       ['박세환', '동탄초', 90, 95, 90, 95, 90, 'C++'],
       ['정태경', '덕소초', 85, 100, 85, 100, 85, nan]], dtype=object)

In [10]:
df.index

Index(['1번', '2번', '3번', '4번'], dtype='object', name='지원번호')

In [11]:
df.columns

Index(['이름', '학교', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [12]:
df.shape #row, column (4개의 줄, 8개의 컬럼)

(4, 8)

## Series 확인

In [13]:
df['수학'].describe()

count      4.000000
mean      92.500000
std        6.454972
min       85.000000
25%       88.750000
50%       92.500000
75%       96.250000
max      100.000000
Name: 수학, dtype: float64

In [15]:
df['수학'].min()

85

In [16]:
df['수학'].max()

100

In [17]:
df['수학'].nlargest(2) #수학 성적 좋은 순서대로 2명 데이터

지원번호
1번    100
2번     95
Name: 수학, dtype: int64

In [18]:
df['수학'].mean()

92.5

In [19]:
df['수학'].sum()

370

In [20]:
df['SW특기'].count()

3

In [21]:
df['학교'].unique()

array(['세종초', '포항초', '동탄초', '덕소초'], dtype=object)

In [22]:
df['학교'].nunique()

4